2016/brp 2016-02-09/test/testcases/nieuwestijl/src/main/resources/testcases/geconverteerd_ARTS/synchronisatie_persoon/VR00090-SyncStructuur-TC04-1-dataresponse.xml

<Results>
    <ResultSet fetchSize="0">
        <Row rowNumber="1">
            <ABONNEMENT>5670041</ABONNEMENT>
            <DATA><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <brp:lvg_synVerwerkPersoon xmlns:brp="http://www.bzk.nl/brp/brp0200">
  <brp:stuurgegevens>
    <brp:zendendePartij>199903</brp:zendendePartij>
    <brp:zendendeSysteem>BRP</brp:zendendeSysteem>
    <brp:ontvangendePartij>036101</brp:ontvangendePartij>
    <brp:ontvangendeSysteem>Leveringsysteem</brp:ontvangendeSysteem>
    <brp:referentienummer>*</brp:referentienummer>
    <brp:tijdstipVerzending>*</brp:tijdstipVerzending>
  </brp:stuurgegevens>
  <brp:parameters>
    <brp:soortSynchronisatie>Volledigbericht</brp:soortSynchronisatie>
    <brp:leveringsautorisatieIdentificatie>*</brp:leveringsautorisatieIdentificatie>
    <brp:dienstIdentificatie>*</brp:dienstIdentificatie>
  </brp:parameters>
  <brp:synchronisatie brp:objecttype="AdministratieveHandeling">
    <brp:code>31003</brp:code>
    <brp:naam>Synchronisatie persoon</brp:naam>
    <brp:categorie>Synchronisatie</brp:categorie>
    <brp:partijCode>036101</brp:partijCode>
    <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
    <brp:bijgehoudenPersonen>
      <brp:persoon brp:communicatieID="1" brp:objecttype="Persoon">
        <brp:soortCode>I</brp:soortCode>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>*</brp:actieInhoud>
          <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>
          <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>N</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>
            <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>
            <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:afgeleidAdministratief brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:tijdstipVerval>*</brp:tijdstipVerval>
            <brp:actieVerval>*</brp:actieVerval>
            <brp:tijdstipLaatsteWijziging>*</brp:tijdstipLaatsteWijziging>
            <brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>*</brp:indicatieOnverwerktBijhoudingsvoorstelNietIngezeteneAanwezig>
        </brp:afgeleidAdministratief>
        <brp:identificatienummers brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2000-01-01</brp:datumAanvangGeldigheid>
          <brp:burgerservicenummer>310027603</brp:burgerservicenummer>
          <brp:administratienummer>3104184328</brp:administratienummer>
        </brp:identificatienummers>
        <brp:samengesteldeNaam brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1971-07-17</brp:datumAanvangGeldigheid>
          <brp:indicatieNamenreeks>N</brp:indicatieNamenreeks>
          <brp:voornamen>Oma</brp:voornamen>
          <brp:geslachtsnaamstam>Vastuullisuutta</brp:geslachtsnaamstam>
        </brp:samengesteldeNaam>
        <brp:geboorte brp:voorkomenSleutel="*">
            <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
            <brp:actieInhoud>*</brp:actieInhoud>
            <brp:datum>*</brp:datum>
            <brp:gemeenteCode>*</brp:gemeenteCode>
            <brp:woonplaatsnaam>*</brp:woonplaatsnaam>
            <brp:landGebiedCode>*</brp:landGebiedCode>
        </brp:geboorte>
        <brp:geslachtsaanduiding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>1971-07-17</brp:datumAanvangGeldigheid>
          <brp:code>M</brp:code>
        </brp:geslachtsaanduiding>
        <brp:inschrijving brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:datum>2000-01-01</brp:datum>
        </brp:inschrijving>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31004</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2013-02-28</brp:datumAanvangGeldigheid>
          <brp:partijCode>098901</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31003</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2012-12-12</brp:datumAanvangGeldigheid>
          <brp:datumEindeGeldigheid>2013-02-28</brp:datumEindeGeldigheid>
          <brp:actieAanpassingGeldigheid>31004</brp:actieAanpassingGeldigheid>
          <brp:partijCode>034301</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31002</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2002-02-02</brp:datumAanvangGeldigheid>
          <brp:datumEindeGeldigheid>2012-12-12</brp:datumEindeGeldigheid>
          <brp:actieAanpassingGeldigheid>31003</brp:actieAanpassingGeldigheid>
          <brp:partijCode>029801</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:datumAanvangGeldigheid>2000-01-01</brp:datumAanvangGeldigheid>
          <brp:datumEindeGeldigheid>2002-02-02</brp:datumEindeGeldigheid>
          <brp:actieAanpassingGeldigheid>31002</brp:actieAanpassingGeldigheid>
          <brp:partijCode>098901</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31003</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>31004</brp:actieVerval>
          <brp:datumAanvangGeldigheid>2012-12-12</brp:datumAanvangGeldigheid>
          <brp:partijCode>034301</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31002</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>31003</brp:actieVerval>
          <brp:datumAanvangGeldigheid>2002-02-02</brp:datumAanvangGeldigheid>
          <brp:partijCode>029801</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:bijhouding brp:voorkomenSleutel="*">
          <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
          <brp:actieInhoud>31001</brp:actieInhoud>
          <brp:tijdstipVerval>*</brp:tijdstipVerval>
          <brp:actieVerval>31002</brp:actieVerval>
          <brp:datumAanvangGeldigheid>2000-01-01</brp:datumAanvangGeldigheid>
          <brp:partijCode>098901</brp:partijCode>
          <brp:bijhoudingsaardCode>I</brp:bijhoudingsaardCode>
          <brp:nadereBijhoudingsaardCode>A</brp:nadereBijhoudingsaardCode>
          <brp:indicatieOnverwerktDocumentAanwezig>N</brp:indicatieOnverwerktDocumentAanwezig>
        </brp:bijhouding>
        <brp:voornamen>*</brp:voornamen>
        <brp:geslachtsnaamcomponenten>*</brp:geslachtsnaamcomponenten>
        <brp:naamgebruik brp:voorkomenSleutel="*">*</brp:naamgebruik>
        <brp:adressen>*</brp:adressen>
        <brp:nationaliteiten>*</brp:nationaliteiten>
        <brp:betrokkenheden>*</brp:betrokkenheden>
        <brp:administratieveHandelingen>
          <brp:administratieveHandeling brp:objectSleutel="*" brp:objecttype="AdministratieveHandeling">
            <brp:code>01011</brp:code>
            <brp:naam>Verbetering geboorteakte</brp:naam>
            <brp:categorie>Correctie</brp:categorie>
            <brp:partijCode>098901</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:objectSleutel="*" brp:communicatieID="document31002">
                <brp:document  brp:objectSleutel="*" brp:objecttype="Document" brp:voorkomenSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:soortNaam>Identiteitsbewijs</brp:soortNaam>
                  <brp:identificatie>373</brp:identificatie>
                  <brp:aktenummer>3737373</brp:aktenummer>
                  <brp:omschrijving>Identiteitsbewijs</brp:omschrijving>
                  <brp:partijCode>098901</brp:partijCode>
                </brp:document>
              </brp:bron>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:objectSleutel="*" brp:communicatieID="document31003">
                <brp:document brp:objectSleutel="*" brp:objecttype="Document" brp:voorkomenSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:soortNaam>Notariële akte</brp:soortNaam>
                  <brp:identificatie>121</brp:identificatie>
                  <brp:aktenummer>1212121</brp:aktenummer>
                  <brp:partijCode>098901</brp:partijCode>
                </brp:document>
              </brp:bron>
              <brp:bron brp:objecttype="AdministratieveHandelingBron"  brp:objectSleutel="*" brp:communicatieID="*">
                <brp:rechtsgrondomschrijving>Het feit ten spijt…</brp:rechtsgrondomschrijving>
              </brp:bron>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:objectSleutel="*" brp:communicatieID="*">
                <brp:rechtsgrondomschrijving>Niettegenstaande het feit dat…</brp:rechtsgrondomschrijving>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="31004">
                <brp:soortNaam>Correctie afstamming</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="document31002"/>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="document31003"/>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="rechtsgrondoms903291388"/>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="rechtsgrondoms-1955207344"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objectSleutel="*" brp:objecttype="AdministratieveHandeling">
            <brp:code>05005</brp:code>
            <brp:naam>Verhuizing intergemeentelijk</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>034301</brp:partijCode>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="31003">
                <brp:soortNaam>Registratie adres</brp:soortNaam>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objectSleutel="*" brp:objecttype="AdministratieveHandeling">
            <brp:code>05005</brp:code>
            <brp:naam>Verhuizing intergemeentelijk</brp:naam>
            <brp:categorie>Actualisering</brp:categorie>
            <brp:partijCode>029801</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:objectSleutel="*" brp:communicatieID="document31001">
                <brp:document  brp:objectSleutel="*" brp:objecttype="Document" brp:voorkomenSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:soortNaam>Geboorteakte</brp:soortNaam>
                  <brp:identificatie>321</brp:identificatie>
                  <brp:aktenummer>9876554</brp:aktenummer>
                  <brp:partijCode>098901</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="31002">
                <brp:soortNaam>Registratie adres</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="document31001"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
          <brp:administratieveHandeling brp:objectSleutel="*" brp:objecttype="AdministratieveHandeling">
            <brp:code>99999</brp:code>
            <brp:naam>GBA - Initiele vulling</brp:naam>
            <brp:categorie>GBA - Initiele vulling</brp:categorie>
            <brp:partijCode>098901</brp:partijCode>
            <brp:bronnen>
              <brp:bron brp:objecttype="AdministratieveHandelingBron" brp:objectSleutel="*" brp:communicatieID="document31001">
                <brp:document brp:objectSleutel="*" brp:objecttype="Document" brp:voorkomenSleutel="*">
                  <brp:tijdstipRegistratie>*</brp:tijdstipRegistratie>
                  <brp:soortNaam>Geboorteakte</brp:soortNaam>
                  <brp:identificatie>321</brp:identificatie>
                  <brp:aktenummer>9876554</brp:aktenummer>
                  <brp:partijCode>098901</brp:partijCode>
                </brp:document>
              </brp:bron>
            </brp:bronnen>
            <brp:bijgehoudenActies>
              <brp:actie brp:objecttype="Actie" brp:objectSleutel="31001">
                <brp:soortNaam>Conversie GBA</brp:soortNaam>
                <brp:bronnen>
                  <brp:bron brp:objecttype="ActieBron" brp:referentieID="document31001"/>
                </brp:bronnen>
              </brp:actie>
            </brp:bijgehoudenActies>
          </brp:administratieveHandeling>
        </brp:administratieveHandelingen>
      </brp:persoon>
    </brp:bijgehoudenPersonen>
  </brp:synchronisatie>
</brp:lvg_synVerwerkPersoon>
  </soap:Body>
</soap:Envelope></DATA>
        </Row>
    </ResultSet>
</Results>
